8evgeny/GIT/5_Amplifier_UM_300/UM_2_MILANDR/uart_rtos/CMSIS/MDR32F2C10/DeviceSupport/startup/iar/startup_MDR32F2C10.s
        PUBWEAK DMA_DONE25_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE25_IRQHandler
        B DMA_DONE25_IRQHandler

        PUBWEAK DMA_DONE26_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE26_IRQHandler
        B DMA_DONE26_IRQHandler

        PUBWEAK DMA_DONE27_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE27_IRQHandler
        B DMA_DONE27_IRQHandler

        PUBWEAK DMA_DONE28_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE28_IRQHandler
        B DMA_DONE28_IRQHandler

        PUBWEAK DMA_DONE29_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE29_IRQHandler
        B DMA_DONE29_IRQHandler

        PUBWEAK DMA_DONE30_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE30_IRQHandler
        B DMA_DONE30_IRQHandler

        PUBWEAK DMA_DONE31_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DMA_DONE31_IRQHandler
        B DMA_DONE31_IRQHandler

        PUBWEAK PORTA_IRQHandler
        SECTION .text:CODE:NOROOT(1)
PORTA_IRQHandler
        B PORTA_IRQHandler

        PUBWEAK PORTB_IRQHandler
        SECTION .text:CODE:NOROOT(1)
PORTB_IRQHandler
        B PORTB_IRQHandler

        PUBWEAK PORTC_IRQHandler
        SECTION .text:CODE:NOROOT(1)
PORTC_IRQHandler
        B PORTC_IRQHandler

        PUBWEAK PORTD_IRQHandler
        SECTION .text:CODE:NOROOT(1)
PORTD_IRQHandler
        B PORTD_IRQHandler

        PUBWEAK ETH_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ETH_IRQHandler
        B ETH_IRQHandler

        PUBWEAK CAN0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAN0_IRQHandler
        B CAN0_IRQHandler

        PUBWEAK CAN1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAN1_IRQHandler
        B CAN1_IRQHandler

        PUBWEAK SSP0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_IRQHandler
        B SSP0_IRQHandler

        PUBWEAK SSP0_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_RXINTR_IRQHandler
        B SSP0_RXINTR_IRQHandler

        PUBWEAK SSP0_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_TXINTR_IRQHandler
        B SSP0_TXINTR_IRQHandler

        PUBWEAK SSP0_RORINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_RORINTR_IRQHandler
        B SSP0_RORINTR_IRQHandler

        PUBWEAK SSP0_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_RTINTR_IRQHandler
        B SSP0_RTINTR_IRQHandler

        PUBWEAK SSP0_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_RNEINTR_IRQHandler
        B SSP0_RNEINTR_IRQHandler

        PUBWEAK SSP0_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_TFEINTR_IRQHandler
        B SSP0_TFEINTR_IRQHandler

        PUBWEAK SSP0_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP0_TBSYINTR_IRQHandler
        B SSP0_TBSYINTR_IRQHandler

        PUBWEAK SSP1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_IRQHandler
        B SSP1_IRQHandler

        PUBWEAK SSP1_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_RXINTR_IRQHandler
        B SSP1_RXINTR_IRQHandler

        PUBWEAK SSP1_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_TXINTR_IRQHandler
        B SSP1_TXINTR_IRQHandler

        PUBWEAK SSP1_RORINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_RORINTR_IRQHandler
        B SSP1_RORINTR_IRQHandler

        PUBWEAK SSP1_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_RTINTR_IRQHandler
        B SSP1_RTINTR_IRQHandler

        PUBWEAK SSP1_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_RNEINTR_IRQHandler
        B SSP1_RNEINTR_IRQHandler

        PUBWEAK SSP1_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_TFEINTR_IRQHandler
        B SSP1_TFEINTR_IRQHandler

        PUBWEAK SSP1_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SSP1_TBSYINTR_IRQHandler
        B SSP1_TBSYINTR_IRQHandler

        PUBWEAK UART0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_IRQHandler
        B UART0_IRQHandler

        PUBWEAK UART0_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_TBSYINTR_IRQHandler
        B UART0_TBSYINTR_IRQHandler

        PUBWEAK UART0_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_TFEINTR_IRQHandler
        B UART0_TFEINTR_IRQHandler

        PUBWEAK UART0_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_RNEINTR_IRQHandler
        B UART0_RNEINTR_IRQHandler

        PUBWEAK UART0_EINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_EINTR_IRQHandler
        B UART0_EINTR_IRQHandler

        PUBWEAK UART0_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_RTINTR_IRQHandler
        B UART0_RTINTR_IRQHandler

        PUBWEAK UART0_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_TXINTR_IRQHandler
        B UART0_TXINTR_IRQHandler

        PUBWEAK UART0_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_RXINTR_IRQHandler
        B UART0_RXINTR_IRQHandler

        PUBWEAK UART0_MSINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART0_MSINTR_IRQHandler
        B UART0_MSINTR_IRQHandler

        PUBWEAK UART1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_IRQHandler
        B UART1_IRQHandler

        PUBWEAK UART1_TBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_TBSYINTR_IRQHandler
        B UART1_TBSYINTR_IRQHandler

        PUBWEAK UART1_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_TFEINTR_IRQHandler
        B UART1_TFEINTR_IRQHandler

        PUBWEAK UART1_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_RNEINTR_IRQHandler
        B UART1_RNEINTR_IRQHandler

        PUBWEAK UART1_EINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_EINTR_IRQHandler
        B UART1_EINTR_IRQHandler

        PUBWEAK UART1_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_RTINTR_IRQHandler
        B UART1_RTINTR_IRQHandler

        PUBWEAK UART1_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_TXINTR_IRQHandler
        B UART1_TXINTR_IRQHandler

        PUBWEAK UART1_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_RXINTR_IRQHandler
        B UART1_RXINTR_IRQHandler

        PUBWEAK UART1_MSINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_MSINTR_IRQHandler
        B UART1_MSINTR_IRQHandler

